In [356]:
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base

db_string = "postgres://postgres:adb@127.0.0.1:5432/adb_lab3"

engine = create_engine(db_string)

Base = declarative_base()
Base.metadata.clear()
for table in engine.table_names():
    engine.execute("DROP TABLE {} CASCADE;".format(table))

In [357]:
from sqlalchemy import create_engine, MetaData, Table, CheckConstraint, UniqueConstraint

print(engine.table_names())

[]

In [358]:
from sqlalchemy import Column, Integer, Float, String, Date, ForeignKey

In [359]:
class Offer(Base):
    __tablename__ = 'offer'
    __table_args__ = (
        CheckConstraint('minimum_nights >= 0'),
        CheckConstraint('reviews_per_month >= 0'),
        UniqueConstraint('id'),
        #UniqueConstraint('name'),
    )
    id = Column(Integer, primary_key=True)
    name = Column(String(300))
    price = Column(Integer)
    minimum_nights = Column(Integer)
    number_of_reviews = Column(Integer)
    last_review = Column(String(300))
    reviews_per_month = Column(Integer)
    calculated_host_listings_count = Column(Integer)
    availability_365 = Column(Integer)
    

    def __repr__(self):
        return "<offer(id={0}, name={1}, price={2}, minimum_nights={3}, number_of_reviews={4}, last_review={5}, \
    reviews_per_month={6}, calculated_host_listings_count={7}, availability_365={8})>".format( 
            self.id, self.name, self.price, self.minimum_nights, self.number_of_reviews, self.last_review, 
        self.reviews_per_month, self.calculated_host_listings_count, self.availability_36)

In [360]:
class Neighbourhood(Base):
    __tablename__ = 'neighbourhood'
    id = Column(Integer, primary_key=True)
    group = Column(String(300))
    name = Column(String(300))
    offer_id = Column(Integer, ForeignKey('offer.id'))
    
    def __repr__(self):
        return "<offer(id='{0}', group={1}, name={2}, offer_id={3})>".format( 
            self.id, self.group, self.name, self.offer_id)

In [361]:
class Room(Base):
    __tablename__ = 'room'
    id = Column(Integer, primary_key=True)
    latitude = Column(Float)
    longitude = Column(Float)
    type = Column(String(300))
    offer_id = Column(Integer, ForeignKey('offer.id'))
    
    def __repr__(self):
        return "<offer(id='{0}', latitude={1}, longitude={2}, type={3}, neighbourhood_group={4}, offer_id={5})>".format( 
            self.id, self.latitude, self.longitude, self.type, self.neighbourhood_group, self.offer_id)

In [362]:
class Host(Base):
    __tablename__ = 'host'
    id = Column(Integer, primary_key=True)
    name = Column(String(300))
    offer_id = Column(Integer, ForeignKey('offer.id'))
    
    def __repr__(self):
        return "<offer(id='{0}', name={1}, offer_id={2})>".format( 
            self.id, self.name, self.offer_id)

In [363]:
Base.metadata.create_all(engine)

In [364]:
import pandas as pd

data = pd.read_csv('AB_NYC_2019.csv')
print(data)

             id                                               name   host_id  \
0          2539                 Clean & quiet apt home by the park      2787
1          2595                              Skylit Midtown Castle      2845
2          3647                THE VILLAGE OF HARLEM....NEW YORK !      4632
3          3831                    Cozy Entire Floor of Brownstone      4869
4          5022   Entire Apt: Spacious Studio/Loft by central park      7192
...         ...                                                ...       ...
48890  36484665    Charming one bedroom - newly renovated rowhouse   8232441
48891  36485057      Affordable room in Bushwick/East Williamsburg   6570630
48892  36485431            Sunny Studio at Historical Neighborhood  23492952
48893  36485609               43rd St. Time Square-cozy single bed  30985759
48894  36487245  Trendy duplex in the very heart of Hell's Kitchen  68119814

           host_name neighbourhood_group       neighbourhood  latitude  \
0               John            Brooklyn          Kensington  40.64749
1           Jennifer           Manhattan             Midtown  40.75362
2          Elisabeth           Manhattan              Harlem  40.80902
3        LisaRoxanne            Brooklyn        Clinton Hill  40.68514
4              Laura           Manhattan         East Harlem  40.79851
...              ...                 ...                 ...       ...
48890        Sabrina            Brooklyn  Bedford-Stuyvesant  40.67853
48891        Marisol            Brooklyn            Bushwick  40.70184
48892  Ilgar & Aysel           Manhattan              Harlem  40.81475
48893            Taz           Manhattan      Hell's Kitchen  40.75751
48894     Christophe           Manhattan      Hell's Kitchen  40.76404

       longitude        room_type  price  minimum_nights  number_of_reviews  \
0      -73.97237     Private room    149               1                  9
1      -73.98377  Entire home/apt    225               1                 45
2      -73.94190     Private room    150               3                  0
3      -73.95976  Entire home/apt     89               1                270
4      -73.94399  Entire home/apt     80              10                  9
...          ...              ...    ...             ...                ...
48890  -73.94995     Private room     70               2                  0
48891  -73.93317     Private room     40               4                  0
48892  -73.94867  Entire home/apt    115              10                  0
48893  -73.99112      Shared room     55               1                  0
48894  -73.98933     Private room     90               7                  0

      last_review  reviews_per_month  calculated_host_listings_count  \
0      2018-10-19               0.21                               6
1      2019-05-21               0.38                               2
2             NaN                NaN                               1
3      2019-07-05               4.64                               1
4      2018-11-19               0.10                               1
...           ...                ...                             ...
48890         NaN                NaN                               2
48891         NaN                NaN                               2
48892         NaN                NaN                               1
48893         NaN                NaN                               6
48894         NaN                NaN                               1

       availability_365
0                   365
1                   355
2                   365
3                   194
4                     0
...                 ...
48890                 9
48891                36
48892                27
48893                 2
48894                23

[48895 rows x 16 columns]

In [365]:
print(data.columns)

Index(['id', 'name', 'host_id', 'host_name', 'neighbourhood_group',
       'neighbourhood', 'latitude', 'longitude', 'room_type', 'price',
       'minimum_nights', 'number_of_reviews', 'last_review',
       'reviews_per_month', 'calculated_host_listings_count',
       'availability_365'],
      dtype='object')

In [366]:
print(data.host_id.describe())

count    4.889500e+04
mean     6.762001e+07
std      7.861097e+07
min      2.438000e+03
25%      7.822033e+06
50%      3.079382e+07
75%      1.074344e+08
max      2.743213e+08
Name: host_id, dtype: float64

In [367]:
print(data.name.describe())

count              48879
unique             47905
top       Hillside Hotel
freq                  18
Name: name, dtype: object

In [368]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48895 entries, 0 to 48894
Data columns (total 16 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              48895 non-null  int64
 1   name                            48879 non-null  object
 2   host_id                         48895 non-null  int64
 3   host_name                       48874 non-null  object
 4   neighbourhood_group             48895 non-null  object
 5   neighbourhood                   48895 non-null  object
 6   latitude                        48895 non-null  float64
 7   longitude                       48895 non-null  float64
 8   room_type                       48895 non-null  object
 9   price                           48895 non-null  int64
 10  minimum_nights                  48895 non-null  int64
 11  number_of_reviews               48895 non-null  int64
 12  last_review                     38843 non-null  object
 13  reviews_per_month               38843 non-null  float64
 14  calculated_host_listings_count  48895 non-null  int64
 15  availability_365                48895 non-null  int64
dtypes: float64(3), int64(7), object(6)
memory usage: 6.0+ MB
None

In [369]:
all_id = data['host_id'].unique()
print("Id array: {0}".format(all_id))

all_names = data['name'].unique()
print("Names array: {0}".format(all_names))

Id array: [     2787      2845      4632 ... 274321313  23492952  68119814]
Names array: ['Clean & quiet apt home by the park' 'Skylit Midtown Castle'
 'THE VILLAGE OF HARLEM....NEW YORK !' ...
 'Sunny Studio at Historical Neighborhood'
 '43rd St. Time Square-cozy single bed'
 "Trendy duplex in the very heart of Hell's Kitchen"]

In [371]:
offer_list = data[['id', 'name', 'price', 'minimum_nights', 'number_of_reviews', 'last_review', 'reviews_per_month',
    'calculated_host_listings_count', 'availability_365']].drop_duplicates().reset_index().drop(columns = ['index']);

offer_list.index.name = 'id'

offer_list

,name,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
id,,,,,,,,
0,Clean & quiet apt home by the park,149,1,9,2018-10-19,0.21,6,365
1,Skylit Midtown Castle,225,1,45,2019-05-21,0.38,2,355
2,THE VILLAGE OF HARLEM....NEW YORK !,150,3,0,NaN,NaN,1,365
3,Cozy Entire Floor of Brownstone,89,1,270,2019-07-05,4.64,1,194
4,Entire Apt: Spacious Studio/Loft by central park,80,10,9,2018-11-19,0.10,1,0
...,...,...,...,...,...,...,...,...
48869,Charming one bedroom - newly renovated rowhouse,70,2,0,NaN,NaN,2,9
48870,Affordable room in Bushwick/East Williamsburg,40,4,0,NaN,NaN,2,36
48871,Sunny Studio at Historical Neighborhood,115,10,0,NaN,NaN,1,27
48872,43rd St. Time Square-cozy single bed,55,1,0,NaN,NaN,6,2
48873,Trendy duplex in the very heart of Hell's Kitchen,90,7,0,NaN,NaN,1,23

In [372]:
offer_list.to_sql('offer',engine, if_exists='append')

In [375]:
neighbourhood_list = data[['neighbourhood_group', 'neighbourhood', 'id']].drop_duplicates()
neighbourhood_list = neighbourhood_list.rename(columns = {'id':'offer_id'})

In [376]:
neighbourhood_list

      neighbourhood_group       neighbourhood  offer_id
0                Brooklyn          Kensington      2539
1               Manhattan             Midtown      2595
2               Manhattan              Harlem      3647
3                Brooklyn        Clinton Hill      3831
4               Manhattan         East Harlem      5022
...                   ...                 ...       ...
48890            Brooklyn  Bedford-Stuyvesant  36484665
48891            Brooklyn            Bushwick  36485057
48892           Manhattan              Harlem  36485431
48893           Manhattan      Hell's Kitchen  36485609
48894           Manhattan      Hell's Kitchen  36487245

[48895 rows x 3 columns]